In [2]:
import pandas as pd
dp=pd.DataFrame({

    "name":["prasanna","aswini","venky","siddu"],
    "age" :["17","18","20","14"],
    "sex" :["female","female","female","male"]
    
})

dp

       name age     sex
0  prasanna  17  female
1    aswini  18  female
2     venky  20  female
3     siddu  14    male

In [2]:
dp

       name age     sex
0  prasanna  17  female
1    aswini  18  female
2     venky  20  female
3     siddu  14    male

In [3]:
dp.describe()

            name age     sex
count          4   4       4
unique         4   4       2
top     prasanna  17  female
freq           1   1       3

In [4]:
dp["age"]

0    17
1    18
2    20
3    14
Name: age, dtype: object

In [5]:
dp["name"]

0    prasanna
1      aswini
2       venky
3       siddu
Name: name, dtype: object

In [6]:
ages=pd.series([14,13,18,20],name="age")

AttributeError: module 'pandas' has no attribute 'series'

In [7]:
ages = pd.Series([17,18,20,14], name="Age")

In [8]:
ages

0    17
1    18
2    20
3    14
Name: Age, dtype: int64

In [9]:
dp

       name age     sex
0  prasanna  17  female
1    aswini  18  female
2     venky  20  female
3     siddu  14    male

In [10]:
ages = pd.Series([17,19,20,14], name="Age")
ages

0    17
1    19
2    20
3    14
Name: Age, dtype: int64

In [11]:
dp

       name age     sex
0  prasanna  17  female
1    aswini  18  female
2     venky  20  female
3     siddu  14    male

In [12]:
dp["age"].max()

'20'

In [13]:
dp["age"].min()

'14'

In [14]:
dp["name"].max()

'venky'

In [15]:
dp["name"].min()

'aswini'

In [1]:
dp[["age","name"]]

NameError: name 'dp' is not defined

In [2]:
dp["name"]

NameError: name 'dp' is not defined

In [3]:
import pandas as pd
dp=pd.DataFrame{
    "name":["prasanna","aswini","venky","siddu"],
    "age" :["17","18","20","14"],
    "sex" :["female","female","female","male"]
    
})
dp

SyntaxError: invalid syntax (Temp/ipykernel_4796/2511494484.py, line 2)

In [ ]:
import pandas as pd
dp=pd.DataFrame({
    "name":["prasanna","aswini","venky","siddu"],
    "age" :["17","18","20","14"],
    "sex" :["female","female","female","male"]
    
})
dp